## Data prerocessing and EDA

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### *Step1--> import all uncleaned dataset*

In [2]:
Customers_df = pd.read_csv(r"C:\Users\LENOVO\Desktop\GUVI\Dataspark project\dataset_for_project\Customers.csv",encoding='latin1')
Sales_df=pd.read_csv(r"C:\Users\LENOVO\Desktop\GUVI\Dataspark project\dataset_for_project\Sales.csv",encoding='Latin1')
Stores_df=pd.read_csv(r"C:\Users\LENOVO\Desktop\GUVI\Dataspark project\dataset_for_project\Stores.csv",encoding='latin1')
Exchange_Rates_df=pd.read_csv(r"C:\Users\LENOVO\Desktop\GUVI\Dataspark project\dataset_for_project\Exchange_Rates.csv")
Products_df=pd.read_csv(r"C:\Users\LENOVO\Desktop\GUVI\Dataspark project\dataset_for_project\Products.csv")

### *Step2-->Check for null values in all dataset*

In [3]:
Customers_df.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [4]:
Sales_df.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [5]:
Stores_df.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [6]:
Exchange_Rates_df.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [7]:
Products_df.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

### *Step 3: filling the missing values using ffill and bfill methods*

In [8]:
#also make sure there are no missing values
Customers_df.ffill(inplace=True)
Customers_df.bfill(inplace=True)
Customers_df.isnull().sum()

CustomerKey    0
Gender         0
Name           0
City           0
State Code     0
State          0
Zip Code       0
Country        0
Continent      0
Birthday       0
dtype: int64

In [9]:
Sales_df.ffill(inplace=True)
Sales_df.bfill(inplace=True)
Sales_df.isnull().sum()

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [10]:
Stores_df.ffill(inplace=True)
Stores_df.bfill(inplace=True)
Stores_df.isnull().sum()

StoreKey         0
Country          0
State            0
Square Meters    0
Open Date        0
dtype: int64

In [11]:
Exchange_Rates_df.isnull().sum()

Date        0
Currency    0
Exchange    0
dtype: int64

In [12]:
Products_df.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

### *Step4-->Drop duplicates for each dataframe*

In [13]:
Customers_df.drop_duplicates(inplace=True)
Sales_df.drop_duplicates(inplace=True)
Stores_df.drop_duplicates(inplace=True)
Exchange_Rates_df.drop_duplicates(inplace=True)
Products_df.drop_duplicates(inplace=True)

### *Step5--> Change the datatype to necessery one to get better insights*
1. here the dtype of birthday is object but the data in the column is date.

In [14]:

print(Customers_df.head())
Customers_df.dtypes

   CustomerKey  Gender               Name            City State Code  \
0          301  Female      Lilly Harding  WANDEARAH EAST         SA
1          325  Female       Madison Hull      MOUNT BUDD         WA
2          554  Female      Claire Ferres       WINJALLOK        VIC
3          786    Male  Jai Poltpalingada    MIDDLE RIVER         SA
4         1042    Male    Aidan Pankhurst   TAWONGA SOUTH        VIC

               State Zip Code    Country  Continent    Birthday
0    South Australia     5523  Australia  Australia    7/3/1939
1  Western Australia     6522  Australia  Australia   9/27/1979
2           Victoria     3380  Australia  Australia   5/26/1947
3    South Australia     5223  Australia  Australia   9/17/1957
4           Victoria     3698  Australia  Australia  11/19/1965

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [15]:
Customers_df['Birthday']=pd.to_datetime(Customers_df['Birthday'],errors='coerce',format='%m/%d/%Y')
Customers_df.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19

In [16]:
Customers_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.2+ MB

In [17]:
Sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  62884 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [18]:
#since both order and Delivery date in object change it
Sales_df['Delivery Date']=pd.to_datetime(Sales_df['Delivery Date'],errors='coerce',format='%m/%d/%Y')
Sales_df['Order Date']=pd.to_datetime(Sales_df['Order Date'],errors='coerce',format='%m/%d/%Y')
Sales_df

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,2016-01-13,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,2021-02-27,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD

In [19]:
Sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   Delivery Date  62884 non-null  datetime64[ns]
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: datetime64[ns](2), int64(6), object(1)
memory usage: 4.3+ MB

In [20]:
Stores_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [21]:
Stores_df['Open Date']=pd.to_datetime(Stores_df['Open Date'],errors='coerce',format='%m/%d/%Y')
Stores_df.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0 2008-01-01
1         2  Australia            Northern Territory          665.0 2008-01-12
2         3  Australia               South Australia         2000.0 2012-01-07
3         4  Australia                      Tasmania         2000.0 2010-01-01
4         5  Australia                      Victoria         2000.0 2015-12-09

In [22]:
Stores_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [23]:
Exchange_Rates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [24]:
Exchange_Rates_df['Date']=pd.to_datetime(Exchange_Rates_df['Date'],errors='coerce',format='%m/%d/%Y')
Exchange_Rates_df

            Date Currency  Exchange
0     2015-01-01      USD    1.0000
1     2015-01-01      CAD    1.1583
2     2015-01-01      AUD    1.2214
3     2015-01-01      EUR    0.8237
4     2015-01-01      GBP    0.6415
...          ...      ...       ...
11210 2021-02-20      USD    1.0000
11211 2021-02-20      CAD    1.2610
11212 2021-02-20      AUD    1.2723
11213 2021-02-20      EUR    0.8238
11214 2021-02-20      GBP    0.7126

[11215 rows x 3 columns]

In [25]:
Exchange_Rates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [26]:
Products_df

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [27]:
Products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [28]:
Products_df.rename(columns={'Unit Cost USD':'Unit_Cost_USD($)','Unit Price USD':'Unit_Price_USD($)'},inplace=True)
Products_df['Unit_Cost_USD($)'] = Products_df['Unit_Cost_USD($)'].str.extract('(\d+)').astype(float)
Products_df['Unit_Price_USD($)'] = Products_df['Unit_Price_USD($)'].str.extract('(\d+)').astype(float)
Products_df['ProductKey'] = Products_df['ProductKey'].astype('Int32')
Products_df['SubcategoryKey'] = Products_df['SubcategoryKey'].astype('Int32')
Products_df['CategoryKey'] = Products_df['CategoryKey'].astype('Int32')

<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
<>:2: SyntaxWarning: invalid escape sequence '\d'
<>:3: SyntaxWarning: invalid escape sequence '\d'
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\1863629697.py:2: SyntaxWarning: invalid escape sequence '\d'
  Products_df['Unit_Cost_USD($)'] = Products_df['Unit_Cost_USD($)'].str.extract('(\d+)').astype(float)
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\1863629697.py:3: SyntaxWarning: invalid escape sequence '\d'
  Products_df['Unit_Price_USD($)'] = Products_df['Unit_Price_USD($)'].str.extract('(\d+)').astype(float)

In [29]:
Products_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ProductKey         2517 non-null   Int32
 1   Product Name       2517 non-null   object
 2   Brand              2517 non-null   object
 3   Color              2517 non-null   object
 4   Unit_Cost_USD($)   2517 non-null   float64
 5   Unit_Price_USD($)  2517 non-null   float64
 6   SubcategoryKey     2517 non-null   Int32
 7   Subcategory        2517 non-null   object
 8   CategoryKey        2517 non-null   Int32
 9   Category           2517 non-null   object
dtypes: Int32(3), float64(2), object(5)
memory usage: 174.6+ KB

### *step6--> converting the cleaned data to mysql table in the preferred database*

In [30]:

from mysql import connector
connection = connector.connect(
    host="localhost",
    user="root",
    password="3123"
)
cursor = connection.cursor()

In [31]:
query="Create database if not exists Guvi_Projects_Dataspark"
cursor.execute(query)

In [32]:
query="Show databases"
cursor.execute(query)
for i in cursor:
    print(i)
connection.commit()
connection.close()

('ds_wd_e_b15',)
('guvi_projects_dataspark',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [33]:
from sqlalchemy import create_engine
con_string='mysql+pymysql://root:3123@localhost/guvi_projects_Dataspark'
engine=create_engine(con_string)

In [34]:
Customers_df.to_sql('Customers',con=engine,index=False,if_exists='replace')
Sales_df.to_sql('Sales',con=engine,index=False,if_exists='replace')
Stores_df.to_sql('Stores',con=engine,index=False,if_exists='replace')
Exchange_Rates_df.to_sql('Exchange_Rates',con=engine,index=False,if_exists='replace')
Products_df.to_sql('Products',con=engine,index=False,if_exists='replace')

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\4124986973.py:1: UserWarning: The provided table name 'Customers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Customers_df.to_sql('Customers',con=engine,index=False,if_exists='replace')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\4124986973.py:2: UserWarning: The provided table name 'Sales' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Sales_df.to_sql('Sales',con=engine,index=False,if_exists='replace')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\4124986973.py:3: UserWarning: The provided table name 'Stores' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Stores_df.to_sql('Stores',con=engine,index=False,if_exists='replace')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\4124986973.py:4: UserWarning: The provided table name 'Exchange_Rates' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Exchange_Rates_df.to_sql('Exchange_Rates',con=engine,index=False,if_exists='replace')
C:\Users\LENOVO\AppData\Local\Temp\ipykernel_15268\4124986973.py:5: UserWarning: The provided table name 'Products' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Products_df.to_sql('Products',con=engine,index=False,if_exists='replace')

2517

In [35]:
engine.dispose()

### *Step7-->converting the cleaned dataframe back to csv files*

In [36]:
Customers_df.to_csv(r'Cleaned_dataset_for_project\Customers.csv',index=False)
Sales_df.to_csv(r'Cleaned_dataset_for_project\Sales.csv',index=False)
Stores_df.to_csv(r'Cleaned_dataset_for_project\Stores.csv',index=False)
Exchange_Rates_df.to_csv(r'Cleaned_dataset_for_project\Exchange_rates.csv',index=False)
Products_df.to_csv(r'Cleaned_dataset_for_project\Products.csv',index=False)